#### Q1. List any five functions of the pandas library with execution.

In [34]:
import pandas as pd

# Create a sample DataFrame with missing values
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [30, 25, None, 35, None],
    'City': ['New York', None, 'Chicago', 'Los Angeles', 'Boston']
}

df = pd.DataFrame(data)
print(df)

      Name   Age         City
0    Alice  30.0     New York
1      Bob  25.0         None
2  Charlie   NaN      Chicago
3    David  35.0  Los Angeles
4      Eve   NaN       Boston

1. head(): Displays the first few rows of a DataFrame (default is 5 rows).

In [35]:
df.head(3)

      Name   Age      City
0    Alice  30.0  New York
1      Bob  25.0      None
2  Charlie   NaN   Chicago

2. info(): Provides a concise summary of a DataFrame, including column names, non-null counts, and data types.

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     3 non-null      float64
 2   City    4 non-null      object
dtypes: float64(1), object(2)
memory usage: 248.0+ bytes

3. describe(): Generates descriptive statistics for numerical columns in a DataFrame.

In [37]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

4. set_index(): Sets the DataFrame index (row labels) using one or more existing columns.

In [38]:
df.set_index('Name')

          Age         City
Name
Alice    30.0     New York
Bob      25.0         None
Charlie   NaN      Chicago
David    35.0  Los Angeles
Eve       NaN       Boston

5. dropna(): Drops rows from a DataFrame that have missing values (NaN).

In [39]:
df.dropna()

    Name   Age         City
0  Alice  30.0     New York
3  David  35.0  Los Angeles

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [41]:
def reindex_with_custom_increment(df2):
    df2 = df2.reset_index(drop=True)
    df2.index = df2.index * 2 + 1
    return df2

data = {
    'A': [10, 20, 30, 40],
    'B': [1, 2, 3, 4],
    'C': ['X', 'Y', 'Z', 'W']
}

df2 = pd.DataFrame(data2)


df_reindexed = reindex_with_custom_increment(df2)
display(df_reindexed)

   A  B  C
1  2  9  4
3  4  8  8
5  5  7  3

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.  
#### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [42]:
data3 = {
    'Values': [10, 20, 30, 40, 50]
}

df3 = pd.DataFrame(data3)

display(df3.head(3))
df3.head(3).sum()

   Values
0      10
1      20
2      30

Values    60
dtype: int64

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [43]:
data4= {
    'Text': ['HI brother','How are You','Thank you']
}
df4= pd.DataFrame(data4)
display(df4)
df4['Word_Count']= df4['Text'].apply(lambda x : len(x.split()))
display(df4)

          Text
0   HI brother
1  How are You
2    Thank you

          Text  Word_Count
0   HI brother           2
1  How are You           3
2    Thank you           2

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

The DataFrame.size and DataFrame.shape attributes in pandas provide different kinds of information about the DataFrame:

DataFrame.size:  
Definition: DataFrame.size returns the number of elements in the DataFrame, which is the total number of cells (rows * columns).  
Usage: It gives you the total count of all elements in the DataFrame, including all rows and columns.    
Example: If a DataFrame has 5 rows and 3 columns, df.size would return 5 * 3 = 15.  

DataFrame.shape:  
Definition: DataFrame.shape returns a tuple representing the dimensions of the DataFrame, i.e., (number of rows, number of columns).  
Usage: It provides the structure of the DataFrame, showing how many rows and columns it contains.  
Example: If a DataFrame has 5 rows and 3 columns, df.shape would return (5, 3).

In [44]:
import pandas as pd

data5 = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}

df5 = pd.DataFrame(data5)


print("DataFrame size:", df5.size) 


print("DataFrame shape:", df5.shape)

DataFrame size: 9
DataFrame shape: (3, 3)

#### Q6. Which function of pandas do we use to read an excel file?

read_excel() function is usefd to read an excel file  
Example  
pd.read_excel('file_path.xlsx')

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
#### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [45]:
def extract_username(df):
   
    def get_username(email):
        return email.split('@')[0]
    
    df['Username'] = df7['Email'].apply(get_username)
    
    return df7

data7 = {
    'Email': [
        'alice@example.com',
        'bob@example.com',
        'charlie@example.com'
    ]
}

df7 = pd.DataFrame(data7)

df7 = extract_username(df7)

display(df7)

                 Email Username
0    alice@example.com    alice
1      bob@example.com      bob
2  charlie@example.com  charlie

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

<pre>For example, if df contains the following values:

   A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2

Your function should select the following rows:   A   B   C

1  8   2   7

4  9   1   2

The function should return a new DataFrame that contains only the selected rows.
</pre>

In [46]:
def select_rows(df8):

    selected_rows = df8[(df8['A'] > 5) & (df8['B'] < 10)]
    
    return selected_rows
data8 = {
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]
}

df8 = pd.DataFrame(data8)

selected_df = select_rows(df8)


display(selected_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [54]:
data9 = {
    'Values2': [10, 20, 30, 40, 50]
}

df9 = pd.DataFrame(data9)
display(df9)
print("Mean-\n",df9.mean())
print("Median-\n",df9.median())
print("STD-\n",df9.std())

   Values2
0       10
1       20
2       30
3       40
4       50

Mean-
 Values2    30.0
dtype: float64
Median-
 Values2    30.0
dtype: float64
Mean-
 Values2    15.811388
dtype: float64

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [56]:
import pandas as pd

def calculate_moving_average(df):

    df = df.sort_values(by='Date')

    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df

data = {
    'Date': pd.date_range(start='2023-01-01', periods=20),
    'Sales': [100, 120, 80, 110, 90, 130, 95, 105, 115, 125, 135, 140, 150, 110, 120, 130, 140, 115, 105, 125]
}

df = pd.DataFrame(data)

calculate_moving_average(df)

         Date  Sales  MovingAverage
0  2023-01-01    100     100.000000
1  2023-01-02    120     110.000000
2  2023-01-03     80     100.000000
3  2023-01-04    110     102.500000
4  2023-01-05     90     100.000000
5  2023-01-06    130     105.000000
6  2023-01-07     95     103.571429
7  2023-01-08    105     104.285714
8  2023-01-09    115     103.571429
9  2023-01-10    125     110.000000
10 2023-01-11    135     113.571429
11 2023-01-12    140     120.714286
12 2023-01-13    150     123.571429
13 2023-01-14    110     125.714286
14 2023-01-15    120     127.857143
15 2023-01-16    130     130.000000
16 2023-01-17    140     132.142857
17 2023-01-18    115     129.285714
18 2023-01-19    105     124.285714
19 2023-01-20    125     120.714286

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
<pre>
For example, if df contains the following values:

         Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

Your function should create the following DataFrame:


         Date    Weekday

0  2023-01-01    Sunday

1  2023-01-02     Monday

2  2023-01-03    Tuesday

3  2023-01-04    Wednesday

4  2023-01-05    Thursday

The function should return the modified DataFrame.
<pre>

In [58]:
def add_weekday_column(df):
  
    df['Date'] = pd.to_datetime(df['Date'])
    
    df['Weekday'] = df['Date'].dt.day_name()
    
    return df

data = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']
}

df = pd.DataFrame(data)

add_weekday_column(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [60]:
def filter_dates(df):
    df['Date'] = pd.to_datetime(df['Date'])
    
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    
    filtered_df = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    
    return filtered_df

data = {
    'Date': ['2023-01-01', '2023-01-15', '2023-02-01', '2023-01-30', '2023-03-01']
}

df = pd.DataFrame(data)

filter_dates(df)

        Date
0 2023-01-01
1 2023-01-15
3 2023-01-30

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is 'pandas'.  
Syntax-  
import pandas as pd